package com.stock.build.DesignModel.wrapper;

/**
 * ==================================
 * 装饰器模式 又称为包装（Wrapper）模式
 * ==================================
 * ***************************************
 * 装饰器模式以多客户端透明的方式扩展对象的功能，
 * 是继承关系的一个替代方案。
 * ***************************************
 * --------------------------------------------
 * 抽象构件角色：
 *  给出一个抽象接口，以规范准备接受附加责任的对象
 * --------------------------------------------
 * @Author mk
 * @Date 2021/6/24 14:16
 * @Version 1.0
 */
public interface CookDinner {
    void cook();
}
